Tekla Open API Reference for Tekla Structures 2025
PluginAttribute Constructor
 The custom attribute [Plugin("PluginName")] uses this to store the name to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginAttribute(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
The name of the plug-in.
See Also
Reference
PluginAttribute Class
Tekla.Structures.Plugins Namespace